leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5744p_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5744PPORTS_H
#define _MPC5744PPORTS_H


/* Pad: 0*/
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_0 {48, 1}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_0 {59, 2}

/* Pad: 1*/
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_1 {60, 2}

/* Pad: 2*/
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_2 {47, 2}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_2 {61, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_2 {97, 1}

/* Pad: 3*/
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_3 {62, 2}
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_3 {49, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_3 {98, 1}

/* Pad: 4*/
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_PWM PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_4 {112, 1}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_4 {65, 1}
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_4 {63, 3}

/* Pad: 5*/
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_5 {70, 1}

/* Pad: 6*/
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_6 {73, 1}

/* Pad: 7*/
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_7 {74, 1}

/* Pad: 8*/
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_8 {44, 1}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_8 {75, 1}

/* Pad: 9*/
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_9 {76, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_9 {98, 2}
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_9 {83, 1}

/* Pad: 10*/
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_10 {49, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_10 {89, 1}
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_10 {96, 1}

/* Pad: 11*/
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_11 {48, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_11 {88, 1}
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_11 {94, 1}

/* Pad: 12*/
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_12 {94, 2}
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_12 {95, 1}

/* Pad: 13*/
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_13 {83, 2}
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_13 {95, 2}
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_13 {47, 1}

/* Pad: 14*/
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_14 {69, 1}

/* Pad: 15*/
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_15 {32, 1}
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_15 {33, 1}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_15 {70, 2}

