leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5744p_portdefs.h
/* Pad: 16*/
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_16 {67, 1}

/* Pad: 17*/
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_17 {32, 2}
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_17 {33, 2}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_17 {68, 1}

/* Pad: 18*/
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 19*/
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_19 {165, 1}

/* Pad: 20*/
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 21*/
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 22*/
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 23*/
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_ADC PORT_FUNCADC
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_23 {165, 2}

/* Pad: 24*/
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_ADC PORT_FUNCADC
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_24 {64, 1}

/* Pad: 25*/
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 26*/
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 27*/
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 28*/
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 29*/
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ADC PORT_FUNCADC
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_29 {166, 1}

/* Pad: 30*/
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ADC PORT_FUNCADC
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_GPT PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_30 {63, 1}

/* Pad: 31*/
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 32*/
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 33*/
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 34*/
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 36*/
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_36 {93, 1}

/* Pad: 37*/
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_37 {86, 1}

/* Pad: 38*/
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_PWM PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_38 {92, 1}

/* Pad: 39*/
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_39 {41, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_39 {91, 1}

/* Pad: 42*/
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_42 {84, 1}
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_42 {97, 2}

/* Pad: 43*/
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_43 {52, 1}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_43 {63, 4}

/* Pad: 44*/
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_44 {64, 3}

/* Pad: 45*/
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_PWM PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_45 {66, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_45 {87, 1}
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_45 {105, 1}

/* Pad: 46*/
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_PWM PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_46 {67, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_46 {106, 1}

/* Pad: 47*/
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_47 {65, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_47 {87, 2}
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER0_PAD_47 {91, 2}

