leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5744p_portdefs.h
/* Pad: 48*/
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_48 {66, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_48 {92, 2}

/* Pad: 49*/
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_49 {67, 3}
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_49 {136, 1}

/* Pad: 50*/
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_50 {68, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_50 {99, 1}
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_FLEXRAY PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_FLEXRAY_PAD_50 {137, 1}

/* Pad: 51*/
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_51 {69, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_51 {97, 3}

/* Pad: 52*/
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_PWM PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_52 {70, 3}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_52 {98, 3}

/* Pad: 53*/
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_53 {85, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_53 {227, 1}
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 54*/
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_54 {51, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_54 {84, 2}
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_54 {99, 2}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_54 {226, 1}
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 55*/
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_55 {50, 2}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_55 {225, 1}
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 56*/
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_56 {69, 3}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_56 {86, 2}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_56 {224, 1}
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 57*/
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 58*/
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_SPI PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_58 {52, 2}
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_GPT PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_58 {59, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_58 {88, 2}

/* Pad: 59*/
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER0 PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_59 {51, 2}
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_GPT PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_59 {60, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_59 {89, 2}

/* Pad: 60*/
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_60 {93, 2}
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_60 {166, 2}

/* Pad: 62*/
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SPI PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_62 {50, 3}
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_GPT PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_62 {62, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_62 {92, 3}

/* Pad: 64*/
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 66*/
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 68*/
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_ADC PORT_FUNCADC

