leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5744p_portdefs.h
/* Pad: 69*/
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 70*/
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 71*/
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 73*/
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 74*/
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 75*/
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 76*/
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER1 PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_77 {51, 3}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_77 {64, 4}

/* Pad: 78*/
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_PWM PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_78 {70, 4}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_78 {113, 1}

/* Pad: 79*/
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_ETH PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_79 {50, 4}

/* Pad: 80*/
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_GPT PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_80 {61, 1}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_80 {91, 3}

/* Pad: 83*/
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_ETH PORT_FUNC4

/* Pad: 84*/
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC3

/* Pad: 85*/
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_85 {52, 3}

/* Pad: 86*/
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 89*/
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 91*/
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 92*/
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_PWM PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_92 {68, 3}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_92 {109, 1}

/* Pad: 93*/
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_PWM PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_93 {69, 4}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_93 {110, 1}

/* Pad: 94*/
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN PORT_FUNC2

/* Pad: 95*/
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_LIN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_95 {166, 3}
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_95 {34, 1}

/* Pad: 98*/
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_98 {96, 2}

/* Pad: 99*/
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_GPT PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_99 {63, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_99 {94, 3}

/* Pad: 100*/
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_GPT PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_100 {64, 2}
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_100 {95, 3}

/* Pad: 101*/
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_ETH PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_101 {99, 3}

/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_PWM PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_102 {97, 4}

/* Pad: 103*/
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_103 {98, 4}

/* Pad: 104*/
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_104 {83, 3}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_104 {233, 1}

/* Pad: 105*/
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_105 {84, 3}

