leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5744p_portdefs.h
/* Pad: 106*/
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_106 {85, 2}

/* Pad: 107*/
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_FLEXRAY PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ETH PORT_FUNC3
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_107 {86, 3}

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_116 {71, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_116 {231, 1}
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_SPI PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_117 {105, 2}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_117 {230, 1}
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_SPI PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_118 {106, 2}

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_GPT PORT_FUNC2
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ETH PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_119 {72, 1}

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_SPI PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_120 {109, 2}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_120 {228, 1}
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_SPI PORT_FUNC3
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_121 {110, 2}

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_122 {73, 2}

/* Pad: 123*/
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_PWM PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_123 {112, 2}

/* Pad: 124*/
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_PWM PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_124 {113, 2}

/* Pad: 125*/
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_125 {74, 2}

/* Pad: 126*/
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_126 {75, 2}

/* Pad: 127*/
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_GPT PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_127 {76, 2}

/* Pad: 128*/
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_128 {71, 2}
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_128 {100, 1}

/* Pad: 129*/
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_129 {72, 2}
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_129 {101, 1}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_129 {232, 1}
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_ETH PORT_FUNC0

/* Pad: 130*/
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_SPI PORT_FUNC2
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_130 {73, 3}
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_130 {102, 1}

/* Pad: 131*/
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_ETH PORT_FUNC4
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_131 {74, 3}
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_PWM PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_PWM_PAD_131 {103, 1}

/* Pad: 132*/
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 133*/
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_CAN PORT_FUNC1

/* Pad: 134*/
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_134 {34, 2}

/* Pad: 135*/
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 136*/
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_GPT PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_137 {75, 3}

