leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/ppc/mpc55xx/drivers/mpc5744p_portdefs.h
/* Pad: 138*/
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_GPT PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_138 {76, 3}

/* Pad: 139*/
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 140*/
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 142*/
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_142 {52, 4}

/* Pad: 143*/
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_143 {51, 4}

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_145 {50, 1}

/* Pad: 146*/
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 147*/
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 148*/
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_SPI PORT_FUNC1

/* Pad: 149*/
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 150*/
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 151*/
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_ADC PORT_FUNCADC

/* Pad: 152*/
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_GPT PORT_FUNC1
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_CAN PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_152 {34, 3}
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_152 {73, 4}
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define INPUT_SELECT_PORT_PIN_MODE_OTHER1_PAD_152 {75, 4}

/* Pad: 153*/
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_GPT PORT_FUNC1
#define INPUT_SELECT_PORT_PIN_MODE_GPT_PAD_153 {76, 4}
#define INPUT_SELECT_PORT_PIN_MODE_ETH_PAD_153 {229, 1}
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_ETH PORT_FUNC0

#endif  /* _MPC5744PPORTS_H*/ 
